consult-mu.org
* consult-mu.el
:PROPERTIES:
:header-args:emacs-lisp: :results none :mkdirp yes :link yes :tangle ./consult-mu.el
:END:
** Header
#+begin_src emacs-lisp
;;; consult-mu.el --- Consult Mu4e asynchronously in GNU Emacs -*- lexical-binding: t -*-

;; Copyright (C) 2023 Armin Darvish

;; Author: Armin Darvish
;; Maintainer: Armin Darvish
;; Created: 2023
;; Version: 0.1
;; Package-Requires: ((emacs "28.0") (consult "0.34") (mu "1.10.7"))
;; Homepage: https://github.com/armindarvish/consult-mu
;; Keywords: convenience, matching, tools, email

;;; Commentary:

;;; Code:

#+end_src

** Requirements
#+begin_src emacs-lisp
;;; Requirements
(eval-when-compile
(require 'consult)
)
#+end_src

** Define Group, Customs, Vars, etc.
*** Group
#+begin_src emacs-lisp
;;; Group

(defgroup consult-mu nil
  "Consulting mu command"
  :group 'convenience
  :group 'minibuffer
  :group 'consult
  :group 'mu4e
  :prefix "consult-mu-")
#+end_src

*** Custom Variables
#+begin_src emacs-lisp
;;; Customization Variables
(defcustom consult-mu-args '("mu")
  "Command line arguments to call `mu` asynchronously.
The dynamically computed arguments are appended.
Can be either a string, or a list of strings or expressions."
  :group 'consult-mu
  :type '(choice string (repeat (choice string sexp))))

(defcustom consult-mu-maxnum 100
  "Maximum number of results normally passed to \"--maxnum\" in the command line. "
  :group 'consult-mu
  :type 'integer)

(defcustom consult-mu-sortfield "date"
  "What field to sort results by "
  :group 'consult-mu
  :type 'string)

(defcustom consult-mu-group-by 'date
  "What field to sort results by "
  :group 'consult-mu
  :type 'symbol)

(defcustom consult-mu-preview-buffer-name "*consult-mu-preview*"
  "Default name to use for preview buffers showing repo readmes retrieved by \"gh repo view\"."
  :group 'consult-mu
  :type 'string)

(defcustom consult-mu-preview-key consult-preview-key
  "Preview key for consult-mu. This is similar `consult-preview-key' but explicitly for consult-mu."
  :type '(choice (const :tag "Any key" any)
                 (list :tag "Debounced"
                       (const :debounce)
                       (float :tag "Seconds" 0.1)
                       (const any))
                 (const :tag "No preview" nil)
                 (key :tag "Key")
                 (repeat :tag "List of keys" key)))


(defcustom consult-mu-highlight-matches t
  "This variable defines whether `consult-mu' highlights search queries (or code snippets) in preview buffers to visually guide the user see the most relevant content in afile."
  :group 'consult-mu
  :type 'boolean)

(defcustom consult-mu-action #'consult-mu--view-action
  "This variable defines the function that is used when selecting a message. By default it is bound to `consult-mu--view-action'."
  :group 'consult-mu
  :type 'function)

#+end_src

*** Other Variables
#+begin_src emacs-lisp
;;; Other Variables
(defvar consult-mu-category 'consult-mu
  "Category symbol for the `consult-mu' package.")

(defvar consult-mu--preview-buffers-list (list)
  "List of currently open preview buffers")

(defvar consult-mu--history nil
  "History variable for `consult-mu'.")

(defvar consult-mu-delimiter "  "
  "Delimiter for fields in mu output.
Taken from  https://github.com/seanfarley/counsel-mu.")

#+end_src

** Define faces
#+begin_src emacs-lisp
;;; Faces

(defface consult-mu-highlight-match-face
  `((t :inherit 'consult-highlight-match))
  "highlight match face in `consult-mu''s preview buffers.
By default inherits from `consult-highlight-match'. "
  )

(defface consult-mu-preview-match-face
  `((t :inherit 'consult-preview-match))
  "highlight match face in `consult-mu''s preview buffers.
 By default inherits from `consult-preview-match'. This face is for example used to highlight the matches to the user's search queries in preview buffer.")

(defface consult-mu-default-face
  `((t :inherit 'default))
  "default face in `consult-mu''s minibuffer annotations.
By default inherits from `default'.")

(defface consult-mu-subject-face
  `((t :inherit 'font-lock-type-face))
  "Subject face in `consult-mu''s minibuffer annotations.
By default inherits from `font-lock-type-face'.")

(defface consult-mu-sender-face
  `((t :inherit 'font-lock-constant-face))
  "Contact face in `consult-mu''s minibuffer annotations.
By default inherits from `font-lock-constant-face'.")

(defface consult-mu-receiver-face
  `((t :inherit 'font-lock-constant-face))
  "Contact face in `consult-mu''s minibuffer annotations.
By default inherits from `font-lock-constant-face'.")

(defface consult-mu-date-face
  `((t :inherit 'font-lock-keyword-face))
  "date face in `consult-mu''s minibuffer annotations.
By default inherits from `font-lock-keyword-face'.")

(defface consult-mu-count-face
  `((t :inherit 'font-lock-type-face))
  "Count face in `consult-mu''s minibuffer annotations.
By default inherits from `font-lock-type-face'.")

(defface consult-mu-tags-face
  `((t :inherit 'font-lock-comment-face))
  "tags/comments face in `consult-mu''s minibuffer annotations.
By default inherits from `font-lock-comment-face'.")

(defface consult-mu-url-face
  `((t :inherit 'link))
  "url face in `consult-mu''s minibuffer annotations; by default inherits from `link'.")

#+end_src

** Backend functions
This section includes functions that make calls to =gh= in the shell or provide helper functionalities for fomrating the responses to be passed to other functions in consult-mu.

*** Utility (formatting, conversion, etc.)
