consult-mu.el

;;; Utility functions

(defun consult-mu--nonutf-cleanup (string)
"Remove non UTF-8 characters if any in the string."
  (string-join
   (delq nil (mapcar (lambda (ch) (encode-coding-char ch 'utf-8 'unicode))
                     string))))

(defun consult-mu--set-string-width (string width &optional prepend)
  "Sets the STRING width to a fixed value, WIDTH.
If the String is longer than WIDTH, it truncates the string and add an ellipsis, \"...\". If the string is shorter it adds whitespace to the string.
If PREPEND is non-nil, it truncates or adds whitespace from the beginning of string, instead of the end."
  (let* ((string (format "%s" string))
         (w (string-width string)))
    (when (< w width)
      (if prepend
          (setq string (format "%s%s" (make-string (- width w) ?\s) (substring string)))
        (setq string (format "%s%s" (substring string) (make-string (- width w) ?\s)))))
    (when (> w width)
      (if prepend
          (setq string (format "...%s" (substring string (- w (- width 3)) w)))
        (setq string (format "%s..." (substring string 0 (- width (+ w 3)))))))
    string))

;; (defun consult-mu--justify-left (string prefix maxwidth)
;;   "Sets the width of  STRING+PREFIX justified from left.
;; It uses `consult-mu--set-string-width' and sets the width of the concatenate of STRING+PREFIX (e.g. `(concat prefix string)`) within MAXWIDTH. This is used for aligning marginalia info in minibuffer when using `consult-mu'."
;;   (let ((s (string-width string))
;;         (w (string-width prefix)))
;;     (cond ((< (+ s w) (floor (/ maxwidth 2)))
;;            (consult-mu--set-string-width string (- (floor (/ maxwidth 2))  w) t))
;;           ((< (+ s w) (floor (/ maxwidth 1.8)))
;;            (consult-mu--set-string-width string (- (floor (/ maxwidth 1.8))  w) t))
;;           ((< (+ s w) (floor (/ maxwidth 1.6)))
;;            (consult-mu--set-string-width string (- (floor (/ maxwidth 1.6))  w) t))
;;           ((< (+ s w) (floor (/ maxwidth 1.4)))
;;            (consult-mu--set-string-width string (- (floor (/ maxwidth 1.4)) w) t))
;;           ((< (+ s w) (floor (/ maxwidth 1.2)))
;;            (consult-mu--set-string-width string (- (floor (/ maxwidth 1.2)) w) t))
;;           ((< (+ s w) maxwidth)
;;            (consult-mu--set-string-width string (- maxwidth w) t))
;;           (t string)
;;           )
;;     ))

(defun consult-mu--justify-left (string prefix maxwidth)
  "Sets the width of  STRING+PREFIX justified from left.
It uses `consult-mu--set-string-width' and sets the width of the concatenate of STRING+PREFIX (e.g. `(concat prefix string)`) within MAXWIDTH. This is used for aligning marginalia info in minibuffer when using `consult-mu'."
  (let ((s (string-width string))
        (w (string-width prefix)))
    (if (> maxwidth w)
    (consult-mu--set-string-width string (- maxwidth w) t)
    string
          )
    ))

(defun consult-mu--highlight-match (regexp str ignore-case)
  "Highlights REGEXP in STR.
If a regular expression contains capturing groups, only these are highlighted.
If no capturing groups are used highlight the whole match.  Case is ignored
if IGNORE-CASE is non-nil.
(This is adapted from `consult--highlight-regexps'.)"
  (let ((i 0))
    (while (and (let ((case-fold-search ignore-case))
                  (string-match regexp str i))
                (> (match-end 0) i))
      (let ((m (match-data)))
        (setq i (cadr m)
              m (or (cddr m) m))
        (while m
          (when (car m)
            (add-face-text-property (car m) (cadr m)
                                    'consult-mu-highlight-match-face nil str))
          (setq m (cddr m))))))
  str)

(defun consult-mu--format-date (string)
  (format "%s %s %s"
          (substring string 0 10)
          (substring string -4 nil)
          (substring string 11 -4)
))

;;; Backend `mu` related functions

(defun consult-mu--call-process (&rest args)
 "Runs \"mu\" in the command line and passes ARGS as command-line arguments.
Returns a list where the CAR is exit status (e.g. 0 means success and non-zero means error) and CADR is the output's text. If mu is not found it returns '(127 \"\") and a message saying \"mu\" is not found."
(if (executable-find "mu")
      (with-temp-buffer
        (set-buffer-file-coding-system 'cp1047)
        (list (apply 'call-process "mu" nil (current-buffer) nil args)                         (replace-regexp-in-string "" "\n"                                                   (buffer-string))))
  (progn
      (message (propertize "\"mu\" is not found on this system" 'face 'warning))
      '(127 ""))
))

(defun consult-mu--command-to-string (&rest args)
  "Runs `consult-mu--call-process' and returns a string if there is no error.
If there are erros passes them to *Messages*."
  (let ((out (apply #'consult-mu--call-process args)))
          (if (= (car out) 0)
              (cadr out)
            (progn
              (message (cadr out))
              nil)
            )))

(defun consult-mu--format-candidate (string input highlight)
  "Formats minibuffer candidates.

INPUT is the query from the user.

if HIGHLIGHT is t, input is highlighted with `consult-mu-highlight-match-face' in the minibuffer."

  (let* ((parts (string-split string consult-mu-delimiter))
         (msgid (car parts))
         (datetime (consult-mu--format-date (cadr parts)))
         (date (substring datetime 0 15))
         (time (substring datetime 16 nil))
         (sender (cadr (cdr parts)))
         (subject (cadr (cdr (cdr parts))))
         (query input)
         (match-str (if (stringp input) (consult--split-escaped (car (consult--command-split query))) nil))
         (str (format "%s\s\s%s\s\s%s"
                      (propertize (consult-mu--set-string-width subject (floor (* (frame-width) 0.6))) 'face 'consult-mu-subject-face)
                      (propertize sender 'face 'consult-mu-sender-face)
                      (propertize (consult-mu--format-date date) 'face 'consult-mu-date-face)))
         (str (propertize str :msgid msgid :subject subject :sender sender :datetime datetime :date date :time time :query query))
         )
    (if (and consult-mu-highlight-matches highlight)
        (cond
         ((listp match-str)
          (mapcar (lambda (match) (setq str (consult-mu--highlight-match match str t))) match-str))
         ((stringp match-str)
          (setq str (consult-mu--highlight-match match-str str t))))
      str)
    (cons str (list :msgid msgid :subject subject :sender sender :datetime datetime :date date :time time :query query))))

(defun consult-mu--lookup ()
"Lookup function for repo candidates in consult-mu.
This is passed as LOOKUP to `consult--read' on candidates and is used to format the output when a candidate is selected."
  (lambda (sel cands &rest args)
    (let* ((info (cdr (assoc sel cands)))
           (msgid (plist-get info :msgid)))
    (cons (format "%s" msgid) info))))

(defun consult-mu--state ()
