consult-mu.el
"State function for consult-mu candidates.

This is passed as STATE to `consult--read' and is used to preview or do other actions on the candidate."
  (lambda (action cand)
    (let* ((preview (consult--buffer-preview))
           )
      (pcase action
            ('preview
             (if cand
                 (when-let ((repo (plist-get (cdr cand) :repo))
                            (query (plist-get (cdr cand) :query))
                            (match-str (consult--build-args query))
                       (buffer (get-buffer-create consult-mu-preview-buffer-name)))
                   (add-to-list 'consult-mu--preview-buffers-list buffer)
                   (consult-mu--repo-view (format "%s" repo) buffer)
                   (with-current-buffer buffer
                     (if consult-mu-highlight-matches
                     (cond
                      ((listp match-str)
                       (mapcar (lambda (item)
                                 (highlight-regexp item 'consult-mu-preview-match-face)) match-str))
                      ((stringp match-str)
                        (highlight-regexp match-str 'consult-mu-preview-match-face))
                      )))
               (funcall preview action
                       buffer
                        )
                   )

             ))
            ('return
             cand)
             )))
      )

(defun consult-mu--group-name (cand)
(get-text-property 0 (if (not (keywordp consult-mu-group-by))  (intern (concat ":" (format "%s" consult-mu-group-by))) consult-mu-group-by)  cand))

(defun consult-mu--group (cand transform)
  "Group candidates in minibuffer for consult-mu.
This is passed as GROUP to `consult--read' and is used to group emails by date."
  (let ((name (consult-mu--group-name cand)))
    (if transform (substring cand) (substring cand))
    ))

(defun consult-mu--view (msgid)
  "Opens message with MSGID in `mu4e-headers-view'."
(mu4e-view-message-with-message-id
   msgid))

(defun consult-mu--view-action (cand)
"Opens the canidate, CAND, from consult-mu.

This is a wrapper function around `consult-mu--view'. It parses CAND to extract relevant msgid and passes them to `consult-mu--view'.

To use this as the default action for consult-mu, set `consult-mu-default-action' to #'consult-mu--view-action."

    (let* ((info (cdr cand))
           (msgid (substring-no-properties (plist-get info :msgid))))
      (consult-mu--view msgid)
      ))

(defun consult-mu--transform (async builder)
  "Adds annotation to minibuffer candiates for `consult-mu'.

Returns ASYNC function after formating results with `consult-mu--format-candidate'.
BUILDER is the command line builder function (e.g. `consult-mu--builder')."
  (let (input)
    `(lambda (action)
      (cond
       ((stringp action)
        (setq input action)
        (funcall ,async action))
       (t (mapcar (lambda (string)
          (consult-mu--format-candidate string input t))
        (funcall ,async action)))
       ))))

(defun consult-mu--builder (input)
  "Build mu command line for searching messages by INPUT (e.g. `mu find INPUT)`."

  (pcase-let* ((consult-mu-args (append consult-mu-args '("find")))
               (cmd (consult--build-args consult-mu-args))
               (`(,arg . ,opts) (consult--command-split input))
               (flags (append cmd opts)))
    (setq opts (append opts (list "--skip-dups" "--nocolor")))
    (setq opts (append opts (list "--fields" (format "i%sd%sf%ss"
                                  consult-mu-delimiter consult-mu-delimiter consult-mu-delimiter))))
    (unless (or (member "-n" flags) (member "--maxnum" flags))
      (setq opts (append opts (list "--maxnum" (format "%s" consult-mu-maxnum)))))
    (unless (or (member "-s" flags) (member "--sortfiled" flags))
      (setq opts (append opts (list "--sortfield" (format "%s" consult-mu-sortfield)))))
    (unless (or (member "-z" flags) (member "--reverse" flags))
      (setq opts (append opts (list "--reverse"))))
    (pcase-let* ((`(,re . ,hl) (funcall consult--regexp-compiler arg 'basic t)))
      (when re
        (cons (append cmd
                      (list (string-join re " "))
                      opts)
              hl)))))

(defun consult-mu--async (prompt builder &optional initial)
"Query mu4e messages asynchronously.

This is a non-interactive internal function. For the interactive version see `consult-mu'.

It runs the command line from `consult-mu--builder' in an async process and returns the results (list of messages) as a completion tabe in minibuffer that will be passed to `consult--read'. The completion table gets dynamically updated as the user types in the minibuffer. Each candidate in the minibuffer is formatted by `consult-mu--transform' to add annotation and other info to the candidate.

PROMPT is the prompt in the minibuffer (passed as PROMPT to `consult--red'.)
BUILDER is an async builder function passed to `consult--async-command'.
INITIAL is an optional arg for the initial input in the minibuffer. (passed as INITITAL to `consult--read'.)
"

  (consult--read
   (consult--async-command builder
     (consult-mu--transform builder)
     )
   :prompt prompt
   :lookup (consult-mu--lookup)
   ;;:state (funcall #'consult-mu--state)
   :initial (consult--async-split-initial initial)
   :group #'consult-mu--group
   :add-history (list (consult--async-split-thingatpt 'symbol))
   :history '(:input consult-mu--history)
   :require-match t
   :category 'consult-mu
   :preview-key consult-mu-preview-key
   :sort nil))

(defun consult-mu (&optional initial noaction)
    "Lists results of `mu find` Asynchronously.

This is an interactive wrapper function around `consult-mu--async'. It queries the user for a search term in the minibuffer, then fetches a list of messages for the entered search term as a minibuffer completion table for selection. The list of candidates in the completion table are dynamically updated as the user changes the entry.

Upon selection of a candidate either
 - the candidate is returned if NOACTION is non-nil
 or
 - the candidate is passed to `consult-mu-action' if NOACTION is nil.

Additional commandline arguments can be passed in the minibuffer entry by typing `--` followed by command line arguments. For example the user can enter the following in the minibuffer:
consult-mu -- -n 10
and the async process will run `mu find -n 10` which changes the limit for the maximum number of results to 10.

INITIAL is an optional arg for the initial input in the minibuffer. (passed as INITITAL to `consult-mu--async').

For more details on consult--async functionalities, see `consult-grep' and the official manual of consult, here: https://github.com/minad/consult.
"
  (interactive)
  (let ((sel
         (consult-mu--async "Search For:  " #'consult-mu--builder initial)))
    (if noaction
        sel
      (progn
        (funcall consult-mu-action sel)
        sel))))

;;; provide `consult-mu' module

(provide 'consult-mu)

;;; filename ends here
