consult-mu.org
*** Main
This section includes additional useful embark actions as well as possible keymaps. This will be provided as examples and starting point to users, so that they can make their own custom embark actions and functions.

#+begin_src emacs-lisp
;;; Requirements
(require 'embark)
(require 'consult-mu)


;;; Define Embark Action Functions
(defun consult-mu-embark-mark-for-delete (cand)
"Mark message for delete"
(let ((msgid (get-text-property 0 :msgid cand)))
  (mu4e-view-message-with-message-id
   msgid)
  (with-current-buffer (mu4e-get-view-buffer)
  (mu4e-view-mark-for-mail-delete)
  )))

(defun consult-mu-embark-trash-message (cand)
  (let* ((msgid (get-text-property 0 :msgid cand))
        (maildir (mu4e-message-field msgid :maildir))
        )
    (print (format "%s:%s" msgid maildir))
    (mu4e-view-message-with-message-id msgid)
    )
)

;;; Define Embark Keymaps

(defvar-keymap consult-mu-embark-general-actions-map
  :doc "Keymap for consult-mu-embark"
  :parent embark-general-map
  "d" #'consult-mu-embark-mark-for-delete
  "t" #'consult-mu-embark-trash-message
  )

(add-to-list 'embark-keymap-alist '(consult-mu . consult-mu-embark-general-actions-map))

;;; Provide `consul-gh-embark' module

(provide 'consult-mu-embark)
#+end_src

* Tests

#+begin_src emacs-lisp
my:test
;;(plist-get my:test :meta)
#+end_src

#+RESULTS:
| :path | /Users/armin/.maildir/gmail/armindarvish/Inbox/cur/1698287678.79045_1.armins-air,U=2337:2,S | :size | 45432 | :changed | (25917 34531 0) | :date | (25913 52078 0) | :from | ((:email Armin.Darvish@us.bosch.com :name Darvish Armin (CR/RCS3-NA))) | :message-id | AM6PR10MB27890776D2FA088DF55813ACCCDDA@AM6PR10MB2789.EURPRD10.PROD.OUTLOOK.COM | :priority | normal | :subject | Your agenda tomorrow | :to | ((:email armindarvish@gmail.com :name armindarvish@gmail.com)) | :maildir | /gmail/armindarvish/Inbox | :flags | (seen attach personal) | :docid | 14751 | :meta | (:path 1b7:z :level 0 :date n6539cb6e :data-tstamp (0 0 0) :root t ...) |

#+begin_src emacs-lisp
(defun my:testfunc (msgid)
(mu4e-search "" nil nil t msgid nil)
(with-current-buffer (mu4e-get-headers-buffer)
(print (plist-get (mu4e-message-at-point) :docid))
))
#+end_src

#+RESULTS:
: my:testfunc

#+begin_src emacs-lisp
(save-mark-and-excursion
(mu4e-search "" nil nil nil "F2.B0.23762.8015D356@hpnplmomiw01" nil)
)
#+end_src


#+begin_src emacs-lisp
(my:testfunc "F2.B0.23762.8015D356@hpnplmomiw01")
#+end_src

#+begin_src emacs-lisp
(mu4e-headers-goto-message-id "F2.B0.23762.8015D356@hpnplmomiw01")
#+end_src

#+RESULTS:


#+begin_src emacs-lisp
(mu4e-headers-goto-message-id "AM6PR10MB27890776D2FA088DF55813ACCCDDA@AM6PR10MB2789.EURPRD10.PROD.OUTLOOK.COM")
#+end_src

#+RESULTS:



#+begin_src emacs-lisp
(mu4e--server-find
     (identity "test")
     mu4e-search-threads
     mu4e-search-sort-field
     mu4e-search-sort-direction
     300
     mu4e-search-skip-duplicates
     mu4e-search-include-related)
#+end_src

#+RESULTS:


#+begin_src emacs-lisp
(with-current-buffer
(mu4e-get-headers-buffer "*consult-mu-headers*" t)
(mu4e-search "test"))
#+end_src

#+RESULTS:
